src/software-installed-log.org
#+TITLE: Software Installed Log

* AutoHotkey
  :PROPERTIES:
  :CUSTOM_ID: autohotkey
  :END:
- Useful with favorite quickshot
- Download from [[https://autohotkey.com/download/][here]] and install.
- Press Start then input autohotkey find 'AutoHotkey Help File' to study
- Write your hotkey file with .ahk name suffix, then double click run it
- Follow is .ahk example(hotkey.ahk)
#+BEGIN_SRC shell
  ; Ctrl+Win+e start emacs
  ^#e::Run C:\win-customize\emacs-26.0.90-x86_64\bin\runemacs.exe -fs
  ; Ctrl+Win+c start cygwin64
  ^#c::Run C:\cygwin64\bin\mintty.exe -
  ; Ctrl+Win+m start mingw64
  ^#m::Run E:\yanyg-data\msys64\msys2_shell.cmd -mingw64
  ; Ctrl+Win+w open work directory
  ^#w::Run explorer.exe E:\yanyg-data\work
  ; Ctrl+Win+b start win 10 ubuntu bash
  ^#b::Run C:\Windows\system32\bash.exe
  ; Ctrl+Win+f start Firefox
  ^#f::Run C:\Program Files\Mozilla Firefox\firefox.exe
  ; Ctrl+Win+g start google chrome
  ^#g::Run C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
  ; Ctrl+Win+v start vmware-view(VDI)
  ^#v::Run C:\Program Files (x86)\VMware\VMware Horizon View Client\vmware-view.exe

  ; swap caps and ctrl for emacs
  Capslock::Ctrl
  Ctrl::Capslock
#+END_SRC

* msys2
** DONE mingw64
   :PROPERTIES:
   :CUSTOM_ID: msys2-mingw64
   :END:

#+BEGIN_SRC sh
  ~$ pacman -Syuu
  :: Synchronizing package databases...
  error: failed retrieving file 'mingw32.db' from repo.msys2.org : Operation too slow. Less than 1 bytes/sec transferred the last 10 seconds#################################################################---]  97%
   mingw32                                                                                               366.7 KiB   343K/s 00:01 [#############################################################################] 100%
   mingw32.sig                                                                                            96.0   B  0.00B/s 00:00 [#############################################################################] 100%
   mingw64                                                                                               366.6 KiB  11.6K/s 00:32 [#############################################################################] 100%
   mingw64.sig                                                                                            96.0   B  0.00B/s 00:00 [#############################################################################] 100%
   msys                                                                                                  158.8 KiB  22.3K/s 00:07 [#############################################################################] 100%
   msys.sig                                                                                               96.0   B  0.00B/s 00:00 [#############################################################################] 100%
  :: Starting core system upgrade...
  warning: terminate other MSYS2 programs before proceeding
  resolving dependencies...
  looking for conflicting packages...

  Packages (5) bash-4.4.012-1  filesystem-2017.05-1  mintty-1~2.8.1-1  msys2-runtime-2.9.0-2  pacman-5.0.1-4

  Total Download Size:   11.52 MiB
  Total Installed Size:  54.80 MiB
  Net Upgrade Size:       3.20 MiB

  :: Proceed with installation? [Y/n] y
  :: Retrieving packages...
  error: failed retrieving file 'msys2-runtime-2.9.0-2-x86_64.pkg.tar.xz' from repo.msys2.org : Operation too slow. Less than 1 bytes/sec transferred the last 10 seconds---------------------------------------]   7%
   msys2-runtime-2.9.0-2-x86_64                                                                            2.2 MiB   306K/s 00:07 [#############################################################################] 100%
  error: failed retrieving file 'bash-4.4.012-1-x86_64.pkg.tar.xz' from repo.msys2.org : Operation too slow. Less than 1 bytes/sec transferred the last 10 seconds----------------------------------------------]   0%
   bash-4.4.012-1-x86_64                                                                                1969.4 KiB   442K/s 00:04 [#############################################################################] 100%
   filesystem-2017.05-1-x86_64                                                                            40.0 KiB  45.1K/s 00:01 [#############################################################################] 100%
   mintty-1~2.8.1-1-x86_64                                                                               233.8 KiB  6.32K/s 00:37 [#############################################################################] 100%
  error: failed retrieving file 'pacman-5.0.1-4-x86_64.pkg.tar.xz' from repo.msys2.org : transfer closed with 6869232 bytes remaining to read-------------------------------------------------------------------]   5%
   pacman-5.0.1-4-x86_64                                                                                   6.6 MiB   200K/s 00:34 [#############################################################################] 100%
  (5/5) checking keys in keyring                                                                                                  [#############################################################################] 100%
  (5/5) checking package integrity                                                                                                [#############################################################################] 100%
  (5/5) loading package files                                                                                                     [#############################################################################] 100%
  (5/5) checking for file conflicts                                                                                               [#############################################################################] 100%
  (5/5) checking available disk space                                                                                             [#############################################################################] 100%
  warning: could not get file information for home/
  warning: could not get file information for opt/
  :: Processing package changes...
  (1/5) upgrading msys2-runtime                                                                                                   [#############################################################################] 100%
  (2/5) upgrading bash                                                                                                            [#############################################################################] 100%
  (3/5) upgrading filesystem                                                                                                      [#############################################################################] 100%
  (4/5) upgrading mintty                                                                                                          [#############################################################################] 100%
  (5/5) upgrading pacman                                                                                                          [#############################################################################] 100%
  warning: terminate MSYS2 without returning to shell and check for updates again
  warning: for example close your terminal window instead of calling exit

  ## Comments: Now exit by click 'close' in windows task bar. And you may see
  Hangup signal received
  ## Comments:
  ## If the mingw64 does not closed, then repeat again or kill by task management.
  ## Then start again and run pacman -Syuu many times until all packages updated.
  ## The final log looks like as:
  ~$ $ pacman -Syuu
  :: Synchronizing package databases...
   mingw32 is up to date
   mingw64 is up to date
   msys is up to date
  :: Starting core system upgrade...
   there is nothing to do
  :: Starting full system upgrade...
   there is nothing to do

  ## Tips: If you network is not stable and you are annoyed by repeated work, try:
  ##  `while :; do yes | pacman -Syuu; done`

  ## Install developer environment (e.g.: emacs): Ref
  ## https://sourceforge.net/p/emacsbinw64/wiki/Build%20guideline%20for%20MSYS2-MinGW-w64%20system/
  ~$ pacman -S base-devel mingw-w64-x86_64-toolchain \
  mingw-w64-x86_64-xpm-nox mingw-w64-x86_64-libtiff \
  mingw-w64-x86_64-giflib mingw-w64-x86_64-jbigkit \
  mingw-w64-x86_64-libpng mingw-w64-x86_64-libjpeg-turbo \
  mingw-w64-x86_64-librsvg mingw-w64-x86_64-libxml2 \
  mingw-w64-x86_64-gnutls

  ~$ pacman -S git

#+END_SRC

* Emacs
** DONE Windows
*** binary install
- Download from [[https://ftp.gnu.org/gnu/emacs/windows/][stable]] or [[https://alpha.gnu.org/gnu/emacs/pretest/windows/][pretest]] version(201711 stable 25.3, pretest 26.0.90)
- Extract the zip to destination directory where you want(e.g.: c:\emacs-26.0.9-mingw64)
- clone your emacs config(see [[#emacs-config][emacs-config]])

*** Msys2 compile
- install [[#msys2-mingw64][mingw64]] first.
- clone your emacs config(see [[#emacs-config][emacs-config]])
#+BEGIN_SRC sh
  ~$ git clone git://git.sv.gnu.org/emacs.git
  ~$ ./autogen.sh
  ~$ PKG_CONFIG_PATH=/mingw64/lib/pkgconfig ./configure --without-imagemagick
  ~$ make
  ~$ make install prefix=/c/emacs
  ~$ cp /mingw64/bin/{libwinpthread-*.dll,libXpm-noX*.dll,libdbus-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libgomp-*.dll,libgcc_s_seh-*.dll,libglib-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libintl-*.dll,libiconv-*.dll,libgobject-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libffi-*.dll,libgdk_pixbuf-*.dll,libgio-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libgmodule-*.dll,zlib*.dll,librsvg-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libcairo-*.dll,libcroco-*.dll,libpango-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libpangocairo-*.dll,libxml2-*.dll,libfontconfig-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libfreetype-*.dll,libpixman-*.dll,libpng*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libpangoft*.dll,libpangowin32-*.dll,liblzma-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libexpat-*.dll,libharfbuzz-*.dll,libgnutls-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libgnutlsxx-*.dll,libtiff-*.dll,libtiffxx-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libjpeg-*.dll,libgif-*.dll,libbz2-*.dll,libjbig-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libgmp-*.dll,libhogweed-*.dll,libnettle-*.dll} /c/emacs-mingw64/bin
  cp /mingw64/bin/{libp11-kit-*.dll,libtasn1-*.dll} /c/emacs-mingw64/bin
#+END_SRC

** TODO Linux
** DONE emacs configuration
   :PROPERTIES:
   :CUSTOM_ID: emacs-config
   :END:

- clone/update config
#+BEGIN_SRC shell
  # Public readonly:
  ~$ cd ~; git clone http://github.com:yygcode/.emacs.d
  # Modified privilege:
  ~$ cd ~; git clone git@github.com:yygcode/.emacs.d
  # Update:
  ~$ cd ~/.emacs.d/; git pull
#+END_SRC
- create hotkey for windows(see [[#autohotkey][AutoHotkey]]).
