software-installed-log.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-23 Sat 09:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Installed Log</title>
<meta name="generator" content="Org mode" />
<link rel="shortcut icon" href="http://ycode.org/css/favicon.ico" />
      <link rel="stylesheet" type="text/css" href="css/site.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://ycode.org"> HOME </a>
</div><div id="content">
<h1 class="title">Software Installed Log</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#autohotkey">1. AutoHotkey</a></li>
<li><a href="#org80dd837">2. msys2</a>
<ul>
<li><a href="#msys2-mingw64">2.1. <span class="done DONE">DONE</span> mingw64</a></li>
</ul>
</li>
<li><a href="#org9a45d10">3. Emacs</a>
<ul>
<li><a href="#org34e0f36">3.1. <span class="done DONE">DONE</span> Windows</a>
<ul>
<li><a href="#org80f070f">3.1.1. binary install</a></li>
<li><a href="#orgfac2f7f">3.1.2. Msys2 compile</a></li>
</ul>
</li>
<li><a href="#orgbe29d97">3.2. <span class="todo TODO">TODO</span> Linux</a></li>
<li><a href="#emacs-config">3.3. <span class="done DONE">DONE</span> emacs configuration</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgac3e54d" class="outline-2">
<h2 id="autohotkey"><a id="orgac3e54d"></a><span class="section-number-2">1</span> AutoHotkey</h2>
<div class="outline-text-2" id="text-autohotkey">
<ul class="org-ul">
<li>Useful with favorite quickshot</li>
<li>Download from <a href="https://autohotkey.com/download/">here</a> and install.</li>
<li>Press Start then input autohotkey find 'AutoHotkey Help File' to study</li>
<li>Write your hotkey file with .ahk name suffix, then double click run it</li>
<li>Follow is .ahk example(hotkey.ahk)</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">; Ctrl+Win+e start emacs
^#e::Run C:\win-customize\emacs-26.0.90-x86_64\bin\runemacs.exe -fs
; Ctrl+Win+c start cygwin64
^#c::Run C:\cygwin64\bin\mintty.exe -
; Ctrl+Win+m start mingw64
^#m::Run E:\yanyg-data\msys64\msys2_shell.cmd -mingw64
; Ctrl+Win+w open work directory
^#w::Run explorer.exe E:\yanyg-data\work
; Ctrl+Win+b start win 10 ubuntu bash
^#b::Run C:\Windows\system32\bash.exe
; Ctrl+Win+f start Firefox
^#f::Run C:\Program Files\Mozilla Firefox\firefox.exe
; Ctrl+Win+g start google chrome
^#g::Run C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
; Ctrl+Win+v start vmware-view(VDI)
^#v::Run C:\Program Files (x86)\VMware\VMware Horizon View Client\vmware-view.exe

; swap caps and ctrl for emacs
Capslock::Ctrl
Ctrl::Capslock
</pre>
</div>
</div>
</div>

<div id="outline-container-org80dd837" class="outline-2">
<h2 id="org80dd837"><span class="section-number-2">2</span> msys2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7642886" class="outline-3">
<h3 id="msys2-mingw64"><a id="org7642886"></a><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> mingw64</h3>
<div class="outline-text-3" id="text-msys2-mingw64">
<div class="org-src-container">
<pre class="src src-sh">~$ pacman -Syuu
:: Synchronizing package databases...
error: failed retrieving file <span style="font-style: italic;">'mingw32.db'</span> from repo.msys2.org : Operation too slow. Less than 1 bytes/sec transferred the last 10 seconds#################################################################---]  97%
 mingw32                                                                                               366.7 KiB   343K/s 00:01 [#############################################################################] 100%
 mingw32.sig                                                                                            96.0   B  0.00B/s 00:00 [#############################################################################] 100%
 mingw64                                                                                               366.6 KiB  11.6K/s 00:32 [#############################################################################] 100%
 mingw64.sig                                                                                            96.0   B  0.00B/s 00:00 [#############################################################################] 100%
 msys                                                                                                  158.8 KiB  22.3K/s 00:07 [#############################################################################] 100%
 msys.sig                                                                                               96.0   B  0.00B/s 00:00 [#############################################################################] 100%
:: Starting core system upgrade...
warning: terminate other MSYS2 programs before proceeding
resolving dependencies...
looking for conflicting packages...

<span style="font-weight: bold;">Packages</span> (5) bash-4.4.012-1  filesystem-2017.05-1  mintty-1~2.8.1-1  msys2-runtime-2.9.0-2  pacman-5.0.1-4

Total Download Size:   11.52 MiB
Total Installed Size:  54.80 MiB
Net Upgrade Size:       3.20 MiB

:: Proceed with installation? [Y/n] y
:: Retrieving packages...
error: failed retrieving file <span style="font-style: italic;">'msys2-runtime-2.9.0-2-x86_64.pkg.tar.xz'</span> from repo.msys2.org : Operation too slow. Less than 1 bytes/sec transferred the last 10 seconds---------------------------------------]   7%
 msys2-runtime-2.9.0-2-x86_64                                                                            2.2 MiB   306K/s 00:07 [#############################################################################] 100%
error: failed retrieving file <span style="font-style: italic;">'bash-4.4.012-1-x86_64.pkg.tar.xz'</span> from repo.msys2.org : Operation too slow. Less than 1 bytes/sec transferred the last 10 seconds----------------------------------------------]   0%
 bash-4.4.012-1-x86_64                                                                                1969.4 KiB   442K/s 00:04 [#############################################################################] 100%
 filesystem-2017.05-1-x86_64                                                                            40.0 KiB  45.1K/s 00:01 [#############################################################################] 100%
 mintty-1~2.8.1-1-x86_64                                                                               233.8 KiB  6.32K/s 00:37 [#############################################################################] 100%
error: failed retrieving file <span style="font-style: italic;">'pacman-5.0.1-4-x86_64.pkg.tar.xz'</span> from repo.msys2.org : transfer closed with 6869232 bytes remaining to read-------------------------------------------------------------------]   5%
 pacman-5.0.1-4-x86_64                                                                                   6.6 MiB   200K/s 00:34 [#############################################################################] 100%
(5/5) checking keys<span style="font-weight: bold;"> in</span> keyring                                                                                                  [#############################################################################] 100%
(5/5) checking package integrity                                                                                                [#############################################################################] 100%
(5/5) loading package files                                                                                                     [#############################################################################] 100%
(5/5) checking for file conflicts                                                                                               [#############################################################################] 100%
(5/5) checking available disk space                                                                                             [#############################################################################] 100%
warning: could not get file information for home/
warning: could not get file information for opt/
:: Processing package changes...
(1/5) upgrading msys2-runtime                                                                                                   [#############################################################################] 100%
(2/5) upgrading bash                                                                                                            [#############################################################################] 100%
(3/5) upgrading filesystem                                                                                                      [#############################################################################] 100%
(4/5) upgrading mintty                                                                                                          [#############################################################################] 100%
(5/5) upgrading pacman                                                                                                          [#############################################################################] 100%
warning: terminate MSYS2 without returning to shell and check for updates again
warning: for example close your terminal window instead of calling exit

<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">Comments: Now exit by click 'close' in windows task bar. And you may see</span>
Hangup signal received
<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">Comments:</span>
<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">If the mingw64 does not closed, then repeat again or kill by task management.</span>
<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">Then start again and run pacman -Syuu many times until all packages updated.</span>
<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">The final log looks like as:</span>
~$ $ pacman -Syuu
:: Synchronizing package databases...
 mingw32 is up to date
 mingw64 is up to date
 msys is up to date
:: Starting core system upgrade...
 there is nothing to do
:: Starting full system upgrade...
 there is nothing to do

<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">Tips: If you network is not stable and you are annoyed by repeated work, try:</span>
<span style="font-weight: bold; font-style: italic;">##  </span><span style="font-weight: bold; font-style: italic;">`while :; do yes | pacman -Syuu; done`</span>

<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">Install developer environment (e.g.: emacs): Ref</span>
<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">https://sourceforge.net/p/emacsbinw64/wiki/Build%20guideline%20for%20MSYS2-MinGW-w64%20system/</span>
~$ pacman -S base-devel mingw-w64-x86_64-toolchain <span style="font-style: italic;">\</span>
mingw-w64-x86_64-xpm-nox mingw-w64-x86_64-libtiff <span style="font-style: italic;">\</span>
mingw-w64-x86_64-giflib mingw-w64-x86_64-jbigkit <span style="font-style: italic;">\</span>
mingw-w64-x86_64-libpng mingw-w64-x86_64-libjpeg-turbo <span style="font-style: italic;">\</span>
mingw-w64-x86_64-librsvg mingw-w64-x86_64-libxml2 <span style="font-style: italic;">\</span>
mingw-w64-x86_64-gnutls

~$ pacman -S git

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9a45d10" class="outline-2">
<h2 id="org9a45d10"><span class="section-number-2">3</span> Emacs</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org34e0f36" class="outline-3">
<h3 id="org34e0f36"><span class="section-number-3">3.1</span> <span class="done DONE">DONE</span> Windows</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org80f070f" class="outline-4">
<h4 id="org80f070f"><span class="section-number-4">3.1.1</span> binary install</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Download from <a href="https://ftp.gnu.org/gnu/emacs/windows/">stable</a> or <a href="https://alpha.gnu.org/gnu/emacs/pretest/windows/">pretest</a> version(201711 stable 25.3, pretest 26.0.90)</li>
<li>Extract the zip to destination directory where you want(e.g.: c:\emacs-26.0.9-mingw64)</li>
<li>clone your emacs config(see <a href="#emacs-config">emacs-config</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-orgfac2f7f" class="outline-4">
<h4 id="orgfac2f7f"><span class="section-number-4">3.1.2</span> Msys2 compile</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>install <a href="#msys2-mingw64">mingw64</a> first.</li>
<li>clone your emacs config(see <a href="#emacs-config">emacs-config</a>)</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">~$ git clone git://git.sv.gnu.org/emacs.git
~$ ./autogen.sh
~$ <span style="font-weight: bold; font-style: italic;">PKG_CONFIG_PATH</span>=/mingw64/lib/pkgconfig ./configure --without-imagemagick
~$ make
~$ make install <span style="font-weight: bold; font-style: italic;">prefix</span>=/c/emacs
~$ cp /mingw64/bin/{libwinpthread-*.dll,libXpm-noX*.dll,libdbus-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libgomp-*.dll,libgcc_s_seh-*.dll,libglib-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libintl-*.dll,libiconv-*.dll,libgobject-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libffi-*.dll,libgdk_pixbuf-*.dll,libgio-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libgmodule-*.dll,zlib*.dll,librsvg-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libcairo-*.dll,libcroco-*.dll,libpango-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libpangocairo-*.dll,libxml2-*.dll,libfontconfig-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libfreetype-*.dll,libpixman-*.dll,libpng*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libpangoft*.dll,libpangowin32-*.dll,liblzma-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libexpat-*.dll,libharfbuzz-*.dll,libgnutls-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libgnutlsxx-*.dll,libtiff-*.dll,libtiffxx-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libjpeg-*.dll,libgif-*.dll,libbz2-*.dll,libjbig-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libgmp-*.dll,libhogweed-*.dll,libnettle-*.dll} /c/emacs-mingw64/bin
cp /mingw64/bin/{libp11-kit-*.dll,libtasn1-*.dll} /c/emacs-mingw64/bin
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbe29d97" class="outline-3">
<h3 id="orgbe29d97"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> Linux</h3>
</div>
<div id="outline-container-org664800e" class="outline-3">
<h3 id="emacs-config"><a id="org664800e"></a><span class="section-number-3">3.3</span> <span class="done DONE">DONE</span> emacs configuration</h3>
<div class="outline-text-3" id="text-emacs-config">
<ul class="org-ul">
<li>clone/update config</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Public readonly:</span>
~$ cd ~; git clone http://github.com:yygcode/.emacs.d
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Modified privilege:</span>
~$ cd ~; git clone git@github.com:yygcode/.emacs.d
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Update:</span>
~$ cd ~/.emacs.d/; git pull
</pre>
</div>
<ul class="org-ul">
<li>create hotkey for windows(see <a href="#autohotkey">AutoHotkey</a>).</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
